Revit 2027 API
NumberingFailures Properties
The BuiltInFailures.NumberingFailures type exposes the following members.
Properties
Name | Description
InputOutOfValidRangeError |  The input value is out of the allowed range.
MoreThenOneElementWasChanged |  The operation lead to the renumbering of more then one element.
NumberAlreadyInUseError |  The new number is already in use.
SampleNumberingError |  Replace this with the first real one
Top
See Also
Reference
BuiltInFailures.NumberingFailures Class
Autodesk.Revit.DB Namespace